foam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    inlet
    {
        type            patch;
        nFaces          110;
        startFace       67928;
    }
    outlet
    {
        type            patch;
        nFaces          122;
        startFace       68038;
    }
    top
    {
        type            patch;
        nFaces          280;
        startFace       68160;
    }
    bottom
    {
        type            patch;
        nFaces          280;
        startFace       68440;
    }
    flapTop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          130;
        startFace       68720;
    }
    flapBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          130;
        startFace       68850;
    }
    flapSide
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2;
        startFace       68980;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       68982;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          34240;
        startFace       69032;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          34240;
        startFace       103272;
    }
)

// ************************************************************************* //
