foam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "497";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
34240
(
(0.78000201657 -4.61533698237e-06 0)
(0.780018677192 -1.36836565693e-05 0)
(0.780052701528 -2.24689312464e-05 0)
(0.780102803563 -3.10120854463e-05 0)
(0.780166295402 -3.93355962413e-05 0)
(0.780241502274 -4.74502226255e-05 0)
(0.780327404691 -5.53593545138e-05 0)
(0.780422969273 -6.30596231111e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.78 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            slip;
    }
    bottom
    {
        type            slip;
    }
    flapTop
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapBottom
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    flapSide
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
