foam/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "497";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
67928
(
2.72430601536e-06
-3.27300844202e-11
2.72439962117e-06
-9.3605743698e-11
2.72454799309e-06
-1.48371929136e-10
2.72474567308e-06
-1.97679905436e-10
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
110
(
-2.72427328524e-06
-2.63624626645e-06
-2.55106358629e-06
-2.46863333839e-06
-2.38886658566e-06
-2.31167726501e-06
-2.23698209436e-06
-2.16470048215e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
122
(
2.74330633968e-06
2.65472427617e-06
2.56905548234e-06
2.48619674468e-06
2.40604953648e-06
2.32851927675e-06
2.25351530537e-06
2.18095051187e-06
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapTop
    {
        type            calculated;
        value           uniform 0;
    }
    flapBottom
    {
        type            calculated;
        value           uniform 0;
    }
    flapSide
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
